@edwardmedia 

Create operation works good:
```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_logging_project_bucket_config.basic will be created
  + resource "google_logging_project_bucket_config" "basic" {
      + bucket_id       = "apache_logs"
      + description     = "Apache logs"
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + location        = "global"
      + name            = (known after apply)
      + project         = "my-project"
      + retention_days  = 60
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_logging_project_bucket_config.basic: Creating...
google_logging_project_bucket_config.basic: Creation complete after 2s [id=projects/my-project/locations/global/buckets/apache_logs]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
Update operation is fine as well:
```
$ terraform apply
google_logging_project_bucket_config.basic: Refreshing state... [id=projects/my-project/locations/global/buckets/apache_logs]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # google_logging_project_bucket_config.basic will be updated in-place
  ~ resource "google_logging_project_bucket_config" "basic" {
        bucket_id       = "apache_logs"
      ~ description     = "Apache logs" -> "Apache logs 65 days"
        id              = "projects/my-project/locations/global/buckets/apache_logs"
        lifecycle_state = "ACTIVE"
        location        = "global"
        name            = "projects/my-project/locations/global/buckets/apache_logs"
        project         = "my-project"
      ~ retention_days  = 60 -> 65
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_logging_project_bucket_config.basic: Modifying... [id=projects/my-project/locations/global/buckets/apache_logs]
google_logging_project_bucket_config.basic: Modifications complete after 1s [id=projects/my-project/locations/global/buckets/apache_logs]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

```
Delete operation didn't make effect on resource:

```
$ terraform destroy
google_logging_project_bucket_config.basic: Refreshing state... [id=projects/everon-test12/locations/global/buckets/apache_logs]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # google_logging_project_bucket_config.basic will be destroyed
  - resource "google_logging_project_bucket_config" "basic" {
      - bucket_id       = "apache_logs" -> null
      - description     = "Apache logs 65 days" -> null
      - id              = "projects/my-project/locations/global/buckets/apache_logs" -> null
      - lifecycle_state = "ACTIVE" -> null
      - location        = "global" -> null
      - name            = "projects/my-project/locations/global/buckets/apache_logs" -> null
      - project         = "everon-test12" -> null
      - retention_days  = 65 -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

google_logging_project_bucket_config.basic: Destroying... [id=projects/my-project/locations/global/buckets/apache_logs]
google_logging_project_bucket_config.basic: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.

```
but with gcloud tool I see that apahe_logs bucket is in ACTIVE state. Should be DELETE_REQUESTED:
```
$ gcloud alpha logging buckets describe apache_logs --location=global --project=my-project
createTime: '2020-10-23T09:08:00.037656026Z'
description: Apache logs 65 days
lifecycleState: ACTIVE
name: projects/my-project/locations/global/buckets/apache_logs
retentionDays: 65
updateTime: '2020-10-23T09:13:24.121270345Z'

```
Could you please have a look?
Thank you.